[{"filename":"hatdog.jpg","description":"Elliott effortlessly pulls off the 'cool guy' look with his sideways hat, though his sleepy eyes suggest it might be past his bedtime. He's the most handsome pup at the party, just taking a quiet moment to himself."},{"filename":"hello.jpg","description":"Well hello there. I was just wondering when you were planning on giving me all of your attention."},{"filename":"hello2.jpg","description":"Caught mid-cuddle with fully-charged laser eyes, Elliott's sleepy head tilt shows he's still just a big softie at heart. He's clearly deep in thought, probably wondering where the snacks are."},{"filename":"helloclose.jpg","description":"With a nose that's impossible to ignore and eyes full of adoration, Elliott proves that personal space is overrated. He's just conducting a very important, up-close inspection of his favorite person."},{"filename":"helloclose2.jpg","description":"With a nose that's clearly begging for a boop, Elliott gets up close and personal to fill your screen with love. He's just making sure you know you're his favorite person."},{"filename":"helloclose3.jpg","description":"This is either the world's biggest yawn or the beginning of a mighty roar demanding more snacks. Either way, it's an expression of pure, unfiltered doggo passion."},{"filename":"helloclose4.jpg","description":"Elliott, looking poised and proper with his paws crossed, patiently waits for you to notice he has activated his laser eyes."},{"filename":"hey.jpg","description":"Elliott, all settled in his favorite spot, gives a look that's equal parts sleepy and \"I am now fully charged.\""},{"filename":"icecream.jpg","description":"In his cozy sweater, Elliott tackles the serious business of enjoying an ice cream cup, giving it his complete and undivided attention. He is a true professional, ensuring not a single drop goes to waste."},{"filename":"im_not_tird.jpg","description":"He insists he's not tired, just resting his eyes for the next big adventure. We'll let him believe that as he drifts off into a sweet, well-deserved slumber."},{"filename":"isleepnow.jpg","description":"This sleepy sailor has navigated his way to the comfiest port in the house for a long night's rest. He's completely conked out, probably dreaming of a vast ocean of treats."},{"filename":"jeeping.jpg","description":"Elliott's ready for an off-road adventure in the Jeep. He's even saved you a seat, though he's clearly claimed the best one for himself."},{"filename":"jeeping2.jpg","description":"Elliott's ready to take the wheel for the next off-road adventure, grinning from ear to ear. He's the happiest captain of the ship, even if he can't quite reach the pedals."},{"filename":"jeepride.jpg","description":"With his head held high and a happy pant, Elliott is the king of the car ride. He's on the lookout for adventure, or maybe just a place that serves bacon."},{"filename":"just_really_happy.jpg","description":"This is the face of pure, unadulterated joy, complete with a goofy, tongue-out smile that shows he's having the absolute best day."}]