[{"filename":"snuggle_time.jpg","description":"Elliott has achieved maximum snuggle capacity, deciding that his human's arm is the best pillow in the world. It's a tough life being this cozy."},{"filename":"snuggleboy.jpg","description":"This sleepy snuggle-bug was caught mid-dream, resulting in a look that's equal parts cozy and \"what year is it?\""},{"filename":"snuggleboy2.jpg","description":"Elliott, the professional snuggler, is off the clock and deep in dreamland, stylishly sporting his favorite fish-themed pajamas. It's a tough job being this cozy, but someone has to do it."},{"filename":"snuggles.jpg","description":"There's no pillow like a human arm, and Elliott is taking full advantage of the situation. He's deep in dreamland, while his human is simply trapped by love."},{"filename":"squish.jpg","description":"Even though he's being used as a headrest by his thirsty friend, Elliott's expression shows he's accepted his fate. This is his life now, a very comfy, albeit slightly squished, pillow."},{"filename":"sup.jpg","description":"In a profound state of relaxation, Elliott has completely melted into the passenger seat. It's a tough life being this comfortable and good-looking."},{"filename":"swimming.jpg","description":"Elliott prepares for a mighty swim by performing a thorough pre-launch inspection of all the smells. Safety first, even for the most adventurous of pups."},{"filename":"swimming2.jpg","description":"Elliott and his best pal enjoying a grand adventure to the lake, where the most important task is sniffing every blade of grass. The leash, having served its purpose of getting them there, was promptly discarded for more important business."},{"filename":"theboys.png","description":"Just a couple of best buds, living their best life on the open road. They're probably debating who gets to control the radio."},{"filename":"this_is_cold.jpg","description":"Elliott stares down the delicious pup cup, mustering all his strength to resist its siren call in favor of a nap. The struggle is real, but the eyelids are heavy."},{"filename":"tinder.jpg","description":"Elliott's dating profile showcases his best qualities: adorable face and treat-loving personality. Swipe right for belly rubs!"},{"filename":"tired.jpg","description":"After a long, hard day of being a dog, Elliott has finally succumbed to the siren call of sleep. He's so tired, he's practically melting into the couch."},{"filename":"toys.jpg","description":"Elliott has gathered all his fluffy friends for a very important meeting. His intense, glowing eyes suggest we are not invited."},{"filename":"toys2.jpg","description":"A classic tale of a boy and his toys, except this chapter involves a very serious interrogation of a fluffy suspect. Elliott is determined to get to the bottom of the squeaker."},{"filename":"toys3.jpg","description":"Elliott looks very serious and sleepy guarding his pile of toys, but his wagging tail betrays his true happiness with his collection."}]