[{"filename":"givememytoy.jpg","description":"With the heart of a sandy gladiator, Elliott gives this game of tug-of-war everything he's got. His face is a perfect blend of fierce determination and pure goofy joy, leaving no doubt as to who the rightful owner of this rope is."},{"filename":"glasses.jpg","description":"Elliott's ready for the open road, looking cooler than all of us in his favorite shades. He takes his co-pilot duties very, very seriously."},{"filename":"glasses2.jpg","description":"Ready for a road trip, Elliott insists on wearing his favorite shades. He hasn't quite mastered the \"cool guy\" look, but he's definitely mastered stealing our hearts."},{"filename":"goofy.jpg","description":"Here we see Elliott in his natural, sleepy habitat, looking both peaceful and profoundly goofy. It's hard work being this cute."},{"filename":"goofy2.jpg","description":"Fast asleep and contorted in the goofiest way, Elliott is clearly having the best dreams. He's so relaxed, he seems to have forgotten where his paws are supposed to go."},{"filename":"goofy3.jpg","description":"This happy face, complete with a floppy tongue, is proof that Elliott has life all figured out. The secret seems to be a mix of good vibes and not a single thought behind those adorable eyes."},{"filename":"goofy4.jpg","description":"Riding shotgun with a smile that could power the whole car, Elliott is clearly having the best day ever. His only job is to be adorable, and he's excelling at it."},{"filename":"goofy5.jpg","description":"Elliott, the happiest co-pilot, is soaking up the sun with a goofy, tongue-out smile. He's the picture of pure bliss, reminding us that sometimes the greatest joy is a simple car ride."},{"filename":"goofy_face.jpg","description":"Elliott is in a state of pure car ride bliss, so content he can't even keep his eyes open. The little tongue sticking out is the official seal of a happy, goofy dog."},{"filename":"goofyboi.jpg","description":"Even in the deepest of slumbers, Elliott knows that the best pillow is his human. Here he is, belly up in a state of pure bliss, proving that comfort and cuddles are his top priorities."},{"filename":"goofyface.jpg","description":"Here's Elliott, taking a break from his busy day of being a dog to show off his award-winning goofy smile. He seems very pleased with his decision to lie in the dirt."},{"filename":"goofyface2.jpg","description":"Elliott is clearly having the best day, though he seems to have forgotten how to put his tongue back in his mouth. This is the face of pure, unadulterated joy after a long day of adventures."},{"filename":"happiestboy.jpg","description":"Behold, the happiest boy in his natural habitat, completely submerged in a pile of his fluffy friends. His smile says it all: he's the king of his comfy, squeaky castle."},{"filename":"happytoys.png","description":"Elliott, the master of snuggles, has successfully gathered all his favorite toys for a group cuddle. His triumphant smile says it all: mission accomplished."},{"filename":"harassing_fish2.jpg","description":"The fish interrogation continues with Elliott's expert questioning techniques. No fishy business will go unnoticed!"}]