[{"filename":"beachhappy.jpg","description":"Pure beach bliss captured in one sandy, grinning face. This golden boy is living his absolute best life."},{"filename":"beachsand.jpg","description":"Elliott, master of sand appreciation, has found treasure or the perfect nap spot. Both are equally valuable."},{"filename":"beachsleepy.jpg","description":"Maximum beach fun has resulted in complete system shutdown. He's earned every grain of this sandy bed."},{"filename":"being_goofy.jpg","description":"Elliott, couch king and master of mischief, plots his next adorable adventure. That innocent look doesn't fool anyone!"},{"filename":"best_pals_forever.png","description":"After epic adventures, Elliott uses his sleepy buddy as the world's furriest pillow. True friendship knows no boundaries."},{"filename":"birds.jpg","description":"Elliott does some serious window shopping at the pet store. The local bird population has his full attention."},{"filename":"boating.jpg","description":"Captain Elliott takes his fishing responsibilities very seriously. No fish will escape his watchful gaze."},{"filename":"boating2.jpg","description":"Elliott's living his best boat life with wind in his fur and joy in his heart. Navigation skills not included!"},{"filename":"bones.jpg","description":"With his two favorite bones and his favorite person, Elliott is living the good life. He's just trying to decide which bone to chew first, a very serious and important decision."},{"filename":"bothering.jpg","description":"After a long, hard day of being a dog, Elliott has found the perfect spot to crash, a contented smile on his face. He's clearly dreaming of all the trouble he can get into tomorrow."},{"filename":"boys.jpg","description":"Two best buds enjoying a sleepover, looking like they're sharing the world's best inside joke."},{"filename":"camping.jpg","description":"Elliott, the ever-faithful camping companion, appears to be contemplating the definition of 'fun' on this outdoor adventure. His unimpressed gaze suggests it might not involve being tied up just out of reach of his favorite ball."},{"filename":"camping2.jpg","description":"Elliott, the majestic camper, taking a moment to question if 'sitting still for a photo' is a real outdoor activity. He seems to have his doubts, but he's a good sport about it."},{"filename":"camping3.jpg","description":"Even after a ruff day of camping, there's always time for a snack in bed with your bestie. These two have officially perfected the art of glamping."},{"filename":"camping4.png","description":"Elliott's showing off his most charming, toothy grin, clearly thrilled with the camping accommodations. His companion, however, seems thoroughly unimpressed and ready for a nap."}]