[{"filename":"excuseme.jpg","description":"I'm trying to have a serious conversation with my favorite fluffy toy. Can I help you?"},{"filename":"fell_asleep_watching_me.png","description":"He fought valiantly to stay awake for his human, but the comfy bed ultimately won the battle. It's a tough life being this adorable and this sleepy."},{"filename":"fell_off_bed.jpg","description":"Even when he's technically falling out of bed, Elliott remains blissfully committed to his nap. Nothing can disturb this level of sleepy determination."},{"filename":"first_horse.jpg","description":"Elliott's inaugural horse encounter balances curiosity with healthy caution. New friends require careful sniff investigations."},{"filename":"first_horse2.jpg","description":"Round two with the horses shows Elliott's growing confidence. Friendship takes patience and treats."},{"filename":"first_horse3.jpg","description":"Elliott, the cautious adventurer, takes a moment to survey the beach from the safety of his car-door cave. He's all for fun, but shade and security clearly come first."},{"filename":"friends.jpg","description":"Elliott and his buddy are all tuckered out after a night of fun. Being best pals is exhausting work."},{"filename":"friends2.jpg","description":"Amidst a whirlwind of new friends at the park, Elliott can't decide who to play with first. It's a ruff life being this popular."},{"filename":"friends3.jpg","description":"Making new friends is serious business, you gotta get a good sniff in and show 'em who's boss with the tail wags."},{"filename":"friends4.jpg","description":"Elliott, a furry whirlwind of excitement, is having the time of his life during a playdate with friends. His tail is wagging so fast it's a blur, powered by pure, unadulterated happiness."},{"filename":"friends5.jpg","description":"Elliott and his pals are on a very serious mission to sniff out the day's most interesting smells. Judging by the wagging tails, the mission is a resounding success."},{"filename":"get_off_my_bed.jpg","description":"Despite the territorial name of the photo, these two best buds have clearly decided sharing is better. They're curled up in a perfect yin-yang of pure, sleepy contentment."},{"filename":"give_now.jpg","description":"Elliott has perfected the art of the silent plea, using his soulful eyes to demand immediate payment in the form of snacks or pets. It's a look that says, \"You know what I want, and I know you're going to give it to me.\""},{"filename":"giveitback.jpg","description":"Armed with his favorite fluffy toy and a pair of irresistibly pleading eyes, Elliott makes a compelling case for keeping his treasure. Good luck arguing with that adorable face."},{"filename":"giveme.jpg","description":"Elliott, looking dapper in his bandana, has brought you his favorite fluffy toy. His serious expression makes it clear that your participation in the upcoming game of fetch is not optional."}]