[{"filename":"outerbanks4.jpg","description":"Coastal winds and wagging tails create pure Outer Banks magic. Elliott's found paradise on earth."},{"filename":"outerbanks5.jpg","description":"Beach patrol duties require constant vigilance and occasional napping. Elliott takes both responsibilities seriously."},{"filename":"outerbanks6.jpg","description":"Sunset strolls and salty air make perfect evening adventures. Elliott's coastal romance is real."},{"filename":"outerbanks7.jpg","description":"Elliott's inner beach dog emerges with full sandy glory. Some personalities shine brightest by the ocean."},{"filename":"outerbanks8.jpg","description":"Making precious memories one sandy paw print at a time. Each step creates lasting coastal magic."},{"filename":"outerbanks9.jpg","description":"Elliott, utterly exhausted from his hard work of sniffing every shell on the beach, enjoys a well-earned, sandy siesta."},{"filename":"pal4.jpg","description":"Making new friends is serious business, requiring a mandatory exchange of snoot boops to verify credentials."},{"filename":"pals.jpg","description":"Elliott and his best pal, taking a break from their important job of making a mess and looking cute."},{"filename":"pals2.jpg","description":"Making new friends is always an adventure, especially when it involves a thorough butt-sniffing inspection. It's the highest form of doggy compliment, really."},{"filename":"pals3.jpg","description":"Elliott and his best friend, proving that true friendship knows no size. It just means one of you might get lost behind the other occasionally."},{"filename":"park.jpg","description":"Elliott takes a moment to enjoy the peacefulness of the park, carefully planning his next sneak attack on an unsuspecting squirrel."},{"filename":"park2.jpg","description":"Elliott takes a moment to majestically survey his kingdom, probably pondering where all the best sticks are buried."},{"filename":"park3.jpg","description":"Even the most exciting walks require a mandatory nap break. Elliott has found the perfect sunbeam to recharge for the rest of his adventure."},{"filename":"park4.jpg","description":"Elliott, the undisputed king of the park bench, soaks up the afternoon sun with a happy grin. He's clearly mastered the art of public lounging, proving that any seat can be a throne if you're a dog who knows his worth."},{"filename":"park5.jpg","description":"After a long day of chasing squirrels and making new friends, Elliott takes a well-deserved break on the park bench. He's pretty sure he's earned the right to hog the whole thing."}]