[{"filename":"naptime.jpg","description":"After a long day of playing, Elliott is all tuckered out, cuddling with his favorite purple toy. He's so tired, he didn't even bother to finish his bone"},{"filename":"naptime2.jpg","description":"Elliott, a true master of comfort, has burrowed himself deep into the couch for a well-deserved nap. He's so cozy that only his nose dares to peek out from under the blanket, as if to say, \"wake me when it's dinner time.\""},{"filename":"nosey.jpg","description":"Just a very good boy on his daily patrol, making sure the river is still there. You can never be too careful when it comes to important bodies of water."},{"filename":"offroad_sleepy3.jpg","description":"Tucked into his bunk after a long day, Elliott cuddles his favorite toy for a well-deserved rest. His thousand-yard stare, however, suggests he's seen some things out on the trail that he can't unsee."},{"filename":"offroad_sleepy4.jpg","description":"A long day of adventures has left Elliott completely spent, but he's still got a tight grip on his favorite fluffy toy. You can't go on adventures without your best pal, even in your dreams."},{"filename":"offroad_sleepy5.jpg","description":"After a long day of adventures, Elliott dramatically stretches onto the bed, ready for a well-deserved nap. His favorite ducky is already waiting to join him for sweet dreams."},{"filename":"outerbanks.jpg","description":"Elliott's Outer Banks adventure begins with coastal discovery excitement. Beach life suits this landlubber perfectly."},{"filename":"outerbanks10.jpg","description":"Seaside serenity captured in one perfect, peaceful moment. Elliott's found his happy place by the water."},{"filename":"outerbanks11.jpg","description":"Beach vibes and boundless energy create the perfect coastal combination. Elliott's inner beach dog is unleashed!"},{"filename":"outerbanks12.jpg","description":"Elliott's coastal adventure continues with tail-wagging enthusiasm. Every wave brings new possibilities."},{"filename":"outerbanks13.jpg","description":"Sandy paws and ocean breezes make for perfect adventure ingredients. Elliott's living the salty dream."},{"filename":"outerbanks14.jpg","description":"Our beach-loving boy thrives in his natural sandy element. Some dogs are just born for coastal living."},{"filename":"outerbanks16.jpg","description":"One last look at an unforgettable coastal getaway. These memories will last furever."},{"filename":"outerbanks2.jpg","description":"Sand exploration and serious sniffing occupy Elliott's full attention. The Outer Banks smell like adventure!"},{"filename":"outerbanks3.jpg","description":"Elliott masters advanced beach exploration techniques with scientific precision. Every grain of sand needs investigation."}]