[{"filename":"park6.jpg","description":"Basking in the sun after a hard day of play, Elliott lets out a mighty yawn of pure satisfaction. He's clearly decided that sitting like a human is the only proper way to relax."},{"filename":"really_happy.jpg","description":"This is the face of pure, unadulterated joy, a smile that could melt the coldest of hearts. He's either having the best dream of his life or he just heard you open the snack drawer."},{"filename":"ride.jpg","description":"Elliott's cheesy grin says it all; he's the happiest co-pilot, ready for any adventure that comes his way."},{"filename":"ride3.jpg","description":"Elliott serves as the most handsome co-pilot, but his concerned expression suggests he's pretty sure you forgot to pack the snacks. He's still a good boy, just a little worried."},{"filename":"ride4.jpg","description":"Elliott's ready for our next adventure, sitting so politely in his seat you'd think he called shotgun. He's the best first mate a captain could ask for on the open road."},{"filename":"ride5.jpg","description":"Elliott is the best co-pilot a person could ask for, even if his expression suggests he has some serious thoughts about your driving."},{"filename":"ride6.jpg","description":"Elliott takes his co-pilot duties very seriously, enjoying the sunset and calmly contemplating the journey ahead. He's probably just thinking about snacks, though."},{"filename":"ride7.jpg","description":"Elliott takes his co-pilot duties very seriously, offering silent, unwavering judgment from the back seat. He just wants to make sure you get to the park safely."},{"filename":"rides.jpg","description":"Elliott is all smiles and ready for adventure, while his co-pilot seems to be seriously reconsidering this whole 'car ride' thing."},{"filename":"riding.jpg","description":"Elliott sits shotgun like a seasoned pro, his trusty duck by his side for the adventure. He's calmly observing the world, probably wondering if that tractor needs a co-pilot too."},{"filename":"riding2.jpg","description":"With his favorite ducky buckled in for the ride, Elliott gazes thoughtfully out the window. He's either contemplating the meaning of life or just wondering where the next snack stop is."},{"filename":"riding3.jpg","description":"The thrill of the open road is apparently too much for this co-pilot. He's decided a mid-ride nap on a comfy lap is a much better adventure."},{"filename":"riding4.jpg","description":"Elliott's ready for a road trip with his best friend, who seems to be taking the job of co-pilot a little more seriously."},{"filename":"safetyfirst.jpg","description":"Even when he's sleepy, Elliott knows safety is the top priority on any adventure. He's buckled in and ready for a nap."},{"filename":"sideeye.jpg","description":"Elliott is all snuggled in for a nap, but he's still keeping a suspicious eye on you. He's judging you, with love."}]