[{"filename":"walk.jpg","description":"Elliott, the world's most dedicated scent detective, is on the case. This particular patch of dirt requires his immediate and thorough investigation."},{"filename":"walking.png","description":"Elliott is all smiles, looking proud of their walking adventure, while his friend has decided that the perfect place for a nap is right here, right now."},{"filename":"watching_tv.jpg","description":"Nothing beats a cozy night in, and Elliott is here for it, completely captivated by the TV. He's the best binge-watching partner a person could ask for."},{"filename":"watchingtv.jpg","description":"Elliott, the distinguished TV critic, has settled in for the evening's programming. He's so focused, he's curled into a perfect, uninterrupted ball of concentration."},{"filename":"what.jpg","description":"Elliott's signature head tilt, complete with glowing laser eyes, is his way of asking what you're doing. He's judging you, but in the most loving way possible."},{"filename":"whattoy.jpg","description":"Elliott sits surrounded by the fluffy guts of a vanquished toy, wearing an expression that hilariously pleads innocence. It's a classic 'it wasn't me' moment, and frankly, we're convinced."},{"filename":"whodis.jpg","description":"Elliott gives a curious but slightly unimpressed look from behind his friend, as if to say, \"And who is this blocking my shot?\""},{"filename":"whyaminthebath.jpg","description":"With a look of profound confusion and a hint of betrayal, Elliott patiently waits in the tub for an explanation. He has accepted his fate, but he doesn't have to be happy about it."},{"filename":"work2.jpg","description":"Elliott takes his job as the office supervisor very seriously. He's not entirely sure what he's supervising, but he's giving it his all."},{"filename":"work3.jpg","description":"Elliott has arrived at the office, ready for a day of hard work and head pats. He's so excited, he's just a blur of happy energy."},{"filename":"wut.jpg","description":"Elliott was clearly in the middle of some very important business when this photo was taken. His expression is the perfect blend of \"excuse me?\" and \"do you have snacks?\""},{"filename":"wut2.jpg","description":"Elliott, in a moment of pure, unadulterated bliss, flashes a goofy, toothy grin that says 'this is the life.' He's so relaxed from the belly rubs, he may have forgotten how his own face works."},{"filename":"wutdude.jpg","description":"With his paws up and eyes blissfully shut, Elliott has achieved a state of relaxation so profound that he can only just manage to ask, \"what now?\" He's so comfortable, he can't even be bothered to open his eyes to see what you want."},{"filename":"wutuwant.jpg","description":"Elliott, the ever-faithful co-pilot, seems to be questioning the driver's navigation with a sleepy yet judgmental gaze. He's just along for the ride and the eventual snacks, of course."},{"filename":"yhellothere.jpg","description":"Even with his most prized possession, his loving eyes show he'd rather have you. The bone is a very close second, though."}]