[{"filename":"lazy.jpg","description":"After a long and exhausting day of being adorable, Elliott has commandeered the best pillow for a strategic nap. He's not lazy, he's just conserving his energy for more cuteness later."},{"filename":"lazy2.jpg","description":"He was too tired to get off the couch, but a dog's gotta eat. He's not lazy, he's just an expert in energy conservation."},{"filename":"leavemealone.jpg","description":"After a long day of being the best boy, Elliott has decided to take a \"paw-sonal\" day. He's currently hiding from the world until further notice (and treats)."},{"filename":"lion_dawg.png","description":"Elliott, in his mightiest lion costume, isn't fooling anyone with those sweet, gentle eyes. He's just a big softy, patiently guarding his favorite purple toy."},{"filename":"longday.jpg","description":"Elliott has officially clocked out for the day, melting into his human's side for some well-deserved rest. He's so tired, he's forgotten how to close his eyes properly."},{"filename":"majestic.jpg","description":"With a look of pure, sleepy contentment, Elliott is the most majestic co-pilot on any road trip. He's either in a state of total bliss or silently judging your singing."},{"filename":"maybefriend.jpg","description":"Elliott gives a potential new park buddy a thorough inspection before officially becoming friends. It's a serious business, this whole making-friends thing."},{"filename":"meeting_a_fish.jpg","description":"Elliott, ever the social butterfly, cautiously introduces himself to the catch of the day. He's pretty sure this is the beginning of a beautiful, if slightly fishy, friendship."},{"filename":"more_toys.jpg","description":"Surrounded by his fluffy entourage, Elliott contemplates the heavy burden of being so incredibly loved and spoiled. He seems to be thinking, \"I love all these toys, but I was hoping for more.\""},{"filename":"mybed.jpg","description":"Having successfully commandeered the bed, Elliott guards his new kingdom with a look of profound seriousness. It's tough work being this comfortable, but someone has to do it."},{"filename":"mybed2.jpg","description":"Elliott has made himself perfectly at home in a sea of blankets, offering a look that's equal parts 'I'm adorable' and 'I'm not moving'."},{"filename":"mychair.jpg","description":"Having claimed the comfiest chair in the house, Elliott is pretty sure the rules now state he's the king of the castle. He's not moving, but he will accept offerings in the form of belly rubs."},{"filename":"mycouch.jpg","description":"Ahoy, check it! Cap'n Elliott done seized this couch, pillow and all, like the treasure it is. He be lookin' real pleased with his new throne."},{"filename":"mycouch2.jpg","description":"After a long, hard day of being a dog, Elliott has decided to melt into the couch for a power nap. He's not sorry, and he's not moving."},{"filename":"mytoys.jpg","description":"Elliott's posted up with his favorite toys after a long day of play. He's keepin' 'em close, 'cause you can't trust these squeaky ducks."}]