{
  "elliott_2.png": "Elliott camping in style - probably dreaming of ice cream while soaking up the great outdoors.",
  "elliott4.jpg": "The moment Elliott finally noticed the treat that had been sitting on his snout for five whole minutes.",
  "elliott3.jpg": "Elliott's less-than-enthusiastic reaction to a Home Depot shopping trip for boat supplies.",
  "elliott2.jpg": "Summer 2025 - Our distinguished gentleman enjoying peaceful pond views in his golden years.",
  "elliott_3.jpg": "Summer 2024 - Elliott living his best camping life in his very own throne.",
  "20240725_191142.jpg": "Elliott and Renzo at camp, both clearly wondering where their ice cream service went wrong.",
  "bath.jpg": "Bath time blues - Elliott's least favorite activity of the week.",
  "beach.jpg": "Beach day contemplation - Elliott weighing the pros and cons of sandy paws.",
  "beach_nap_time.jpg": "Post-beach exhaustion calls for an impromptu nap session.",
  "birds.jpg": "Window shopping at the pet store - Elliott sizing up the local bird population.",
  "boating.jpg": "Captain Elliott reporting for fishing duty!",
  "boating_happy.jpg": "Pure joy on the water - Elliott's tail-wagging boat enthusiasm on full display.",
  "first_horse.jpg": "Elliott's inaugural horse meeting - curiosity meets caution.",
  "first_horse2.jpg": "Round two with the horses - Elliott gaining confidence.",
  "outerbanks.jpg": "Outer Banks adventure begins - Elliott discovers coastal living.",
  "outerbanks2.jpg": "Sand, surf, and serious sniffing at the Outer Banks.",
  "outerbanks3.jpg": "Elliott mastering the art of beach exploration.",
  "outerbanks4.jpg": "Coastal winds and wagging tails - Outer Banks perfection.",
  "outerbanks5.jpg": "Elliott's beach patrol duties in full swing.",
  "outerbanks6.jpg": "Sunset strolls and salty air at the Outer Banks.",
  "outerbanks7.jpg": "Elliott embracing his inner beach dog.",
  "outerbanks8.jpg": "Making memories one paw print at a time.",
  "outerbanks9jpg": "Golden hour magic with our favorite beach explorer.",
  "outerbanks10.jpg": "Elliott's seaside serenity captured perfectly.",
  "outerbanks11.jpg": "Beach vibes and boundless energy at the coast.",
  "outerbanks12.jpg": "Elliott's coastal adventure continues.",
  "outerbanks13.jpg": "Sandy adventures and ocean breezes with Elliott.",
  "outerbanks14.jpg": "Our beach-loving boy in his natural element.",
  "outerbanks15.jpg": "Elliott's Outer Banks finale - thoroughly satisfied.",
  "outerbanks16.jpg": "Last look back at an unforgettable coastal getaway.",
  "tinder.jpg": "Elliott's dating profile photo - 'Loves long walks and belly rubs.'",
  "harassing_fish.jpg": "Elliott conducting a thorough investigation at Cabela's aquarium.",
  "harassing_fish2.jpg": "The fish interrogation continues - Elliott's detective work in progress."
}
